## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 16 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                        NAME                                        |
|----------|------------------------------------------------------------------------------------|
| add      | `aws_secretsmanager_secret.zidatel_database_proxy_auth`                            |
|          | `aws_secretsmanager_secret_version.zidatel_database_proxy_auth`                    |
|          | `module.idp_database.aws_cloudwatch_log_group.proxy[0]`                            |
|          | `module.idp_database.aws_db_proxy.proxy[0]`                                        |
|          | `module.idp_database.aws_db_proxy_default_target_group.this[0]`                    |
|          | `module.idp_database.aws_db_proxy_target.target[0]`                                |
|          | `module.idp_database.aws_iam_policy.read_connection_string[0]`                     |
|          | `module.idp_database.aws_iam_role.rds_proxy[0]`                                    |
|          | `module.idp_database.aws_iam_role_policy_attachment.read_connection_string[0]`     |
|          | `module.idp_database.aws_secretsmanager_secret.connection_string[0]`               |
|          | `module.idp_database.aws_secretsmanager_secret.proxy_connection_string[0]`         |
|          | `module.idp_database.aws_secretsmanager_secret_version.connection_string[0]`       |
|          | `module.idp_database.aws_secretsmanager_secret_version.proxy_connection_string[0]` |
| update   | `aws_ssm_parameter.zitadel_database_host`                                          |
|          | `module.idp_ecs.aws_iam_policy.this_task_exec`                                     |
| recreate | `module.idp_database.aws_security_group.rds`                                       |
|          | `module.idp_database.aws_security_group_rule.rds_egress`                           |
|          | `module.idp_database.aws_security_group_rule.rds_ingress`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_password",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_username",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_host",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_name",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_password",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_username",
              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_secret_key",
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_secretsmanager_secret.zidatel_database_proxy_auth will be created
  + resource "aws_secretsmanager_secret" "zidatel_database_proxy_auth" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zidatel_database_proxy_auth"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.zidatel_database_proxy_auth will be created
  + resource "aws_secretsmanager_secret_version" "zidatel_database_proxy_auth" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_ssm_parameter.zitadel_database_host will be updated in-place
  ~ resource "aws_ssm_parameter" "zitadel_database_host" {
        id              = "zitadel_database_host"
      + insecure_value  = (known after apply)
        name            = "zitadel_database_host"
        tags            = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.idp_database.data.aws_iam_policy_document.read_connection_string[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "read_connection_string" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "0"
        }
      + statement {
          + actions   = [
              + "secretsmanager:ListSecrets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "1"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "2"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "secretsmanager.ca-central-1.amazonaws.com",
                ]
              + variable = "kms:ViaService"
            }
        }
    }

  # module.idp_database.aws_cloudwatch_log_group.proxy[0] will be created
  + resource "aws_cloudwatch_log_group" "proxy" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/proxy/idp-proxy"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "idp_proxy_logs"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "idp_proxy_logs"
          + "Terraform"  = "true"
        }
    }

  # module.idp_database.aws_db_proxy.proxy[0] will be created
  + resource "aws_db_proxy" "proxy" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "POSTGRESQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "idp-proxy"
      + require_tls            = true
      + role_arn               = (known after apply)
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "idp-rds-proxy"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "idp-rds-proxy"
          + "Terraform"  = "true"
        }
      + vpc_security_group_ids = (known after apply)
      + vpc_subnet_ids         = [
          + "subnet-07e38df0760d389d1",
          + "subnet-07f9debd31e48ce64",
          + "subnet-0af8e6e3cf80f582d",
        ]

      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "Additional proxy authentication"
          + iam_auth                  = "DISABLED"
          + secret_arn                = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "The database connection string"
          + iam_auth                  = "DISABLED"
          + secret_arn                = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.idp_database.aws_db_proxy_default_target_group.this[0] will be created
  + resource "aws_db_proxy_default_target_group" "this" {
      + arn           = (known after apply)
      + db_proxy_name = "idp-proxy"
      + id            = (known after apply)
      + name          = (known after apply)

      + connection_pool_config (known after apply)
    }

  # module.idp_database.aws_db_proxy_target.target[0] will be created
  + resource "aws_db_proxy_target" "target" {
      + db_cluster_identifier = "idp-cluster"
      + db_proxy_name         = "idp-proxy"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + port                  = (known after apply)
      + rds_resource_id       = (known after apply)
      + target_arn            = (known after apply)
      + target_group_name     = (known after apply)
      + tracked_cluster_id    = (known after apply)
      + type                  = (known after apply)
    }

  # module.idp_database.aws_iam_policy.read_connection_string[0] will be created
  + resource "aws_iam_policy" "read_connection_string" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "idpReadConnectionString"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # module.idp_database.aws_iam_role.rds_proxy[0] will be created
  + resource "aws_iam_role" "rds_proxy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "rds.amazonaws.com"
                        }
                      + Sid       = "RDSAssume"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "idp_rds_proxy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.idp_database.aws_iam_role_policy_attachment.read_connection_string[0] will be created
  + resource "aws_iam_role_policy_attachment" "read_connection_string" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_rds_proxy"
    }

  # module.idp_database.aws_secretsmanager_secret.connection_string[0] will be created
  + resource "aws_secretsmanager_secret" "connection_string" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "idp-6ky1lc"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica (known after apply)
    }

  # module.idp_database.aws_secretsmanager_secret.proxy_connection_string[0] will be created
  + resource "aws_secretsmanager_secret" "proxy_connection_string" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "idp-6ky1lc-proxy-connection-string"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica (known after apply)
    }

  # module.idp_database.aws_secretsmanager_secret_version.connection_string[0] will be created
  + resource "aws_secretsmanager_secret_version" "connection_string" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.idp_database.aws_secretsmanager_secret_version.proxy_connection_string[0] will be created
  + resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.idp_database.aws_security_group.rds must be replaced
+/- resource "aws_security_group" "rds" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:687401027353:security-group/sg-0cfa825ebfee9088e" -> (known after apply)
      ~ description            = "The Security group that allows communication between the application and the database" -> "The Security group that allows communication between the proxy and the database" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Egress from the database"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ id                     = "sg-0cfa825ebfee9088e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress to the database"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ name                   = "idp_rds_sg" -> "idp_rds_proxy_sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "687401027353" -> (known after apply)
      ~ tags                   = {
            "CostCentre" = "forms-platform-staging"
          ~ "Name"       = "idp_rds_sg" -> "idp_rds_proxy_sg"
            "Terraform"  = "true"
        }
      ~ tags_all               = {
          ~ "Name"       = "idp_rds_sg" -> "idp_rds_proxy_sg"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.idp_database.aws_security_group_rule.rds_egress must be replaced
-/+ resource "aws_security_group_rule" "rds_egress" {
      ~ id                       = "sgrule-761929801" -> (known after apply)
      ~ security_group_id        = "sg-0cfa825ebfee9088e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-03e708f5693e05646" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.idp_database.aws_security_group_rule.rds_ingress must be replaced
-/+ resource "aws_security_group_rule" "rds_ingress" {
      ~ id                       = "sgrule-3914336409" -> (known after apply)
      ~ security_group_id        = "sg-0cfa825ebfee9088e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-03e708f5693e05646" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/ecs/idp/zitadel:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.idp_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::687401027353:policy/zitadel_ecs_task_exec_policy"
        name             = "zitadel_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/ecs/idp/zitadel:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_secret_key",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_username",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_password",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_name",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_host",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_username",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_password",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username",
                          - "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 16 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
